org/2021/graduation-thesis.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 毕业设计

这里记录我完成毕业设计的全过程。

* 论文题目申报

题目：基于 MongoDB 的学生信息管理系统

论文选题目的、原理、路线：

随着Web3.0的到来，有越来越多的新技术来到我们面前，而面对旧有的系统设计，作为一名热爱编程的毕业生，我想用新技术做到和旧有技术一样的事情，并在此基础上有更易用的设计和优美简洁的外观。因此我决定使用MongoDB+Express+Vue+Nodejs重新设计一套学生信息管理系统。

本设计预期使用MongoDB开源数据库，Express作为服务器，使用Vue设计页面模板，通过Bootstrap进行页面美化，Node.js提供后端支持。整个项目通过代码编辑器Visual Studio Code管理，项目依赖由yarn控制，版本控制和网站发布使用GitHub，Axios把前端展示与后端数据库数据双向同步更新。经过需求分析、系统设计、系统实现和测试等面向对象的软件开发流程，实现一套部署在网页端的学生信息管理系统。本系统在设计上根据教务处管理学生信息的实际工作划分为三个流程，第一步添加学生信息；第二步更改或删除学生信息；第三步查看学生信息。另外，对这些信息进行权限划分，对教务处老师开放全部学生信息、任课教师只能看到所教班级的学生信息、学生只能查看自己的相关信息。

在项目的测试阶段，将大量测试数据作为真实学生信息导入系统，在基础服务器资源有限的情况下，能够提供给老师和学生更加稳定的服务、更加舒适的界面、更加方便地处理和查看信息。