blog/2021/graduation-thesis.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 22:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>毕业设计</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">毕业设计</h1>
</header><p>
这里记录我完成毕业设计的全过程。
</p>

<div id="outline-container-org282f6c6" class="outline-2">
<h2 id="org282f6c6">论文题目申报</h2>
<div class="outline-text-2" id="text-org282f6c6">
<p>
题目：基于 MongoDB 的学生信息管理系统
</p>

<p>
论文选题目的、原理、路线：
</p>

<p>
随着 Web3.0 的到来，有越来越多的新技术来到我们面前，而面对旧有的系统设计，作为一名热爱编程的毕业生，我想用新技术做到和旧有技术一样的事情，并在此基础上有更易用的设计和优美简洁的外观。因此我决定使用 MongoDB+Express+Vue+Nodejs 重新设计一套学生信息管理系统。
</p>

<p>
本设计预期使用 MongoDB 开源数据库，Express 作为服务器，使用 Vue 设计页面模板，通过 Bootstrap 进行页面美化，Node.js 提供后端支持。整个项目通过代码编辑器 Visual Studio Code 管理，项目依赖由 yarn 控制，版本控制和网站发布使用 GitHub，Axios 把前端展示与后端数据库数据双向同步更新。经过需求分析、系统设计、系统实现和测试等面向对象的软件开发流程，实现一套部署在网页端的学生信息管理系统。本系统在设计上根据教务处管理学生信息的实际工作划分为三个流程，第一步添加学生信息；第二步更改或删除学生信息；第三步查看学生信息。另外，对这些信息进行权限划分，对教务处老师开放全部学生信息、任课教师只能看到所教班级的学生信息、学生只能查看自己的相关信息。
</p>

<p>
在项目的测试阶段，将大量测试数据作为真实学生信息导入系统，在基础服务器资源有限的情况下，能够提供给老师和学生更加稳定的服务、更加舒适的界面、更加方便地处理和查看信息。</p>
</div>
</div>
</div>
</body>
</html>